/* global hexo */
const logger = require('hexo-log')();

/**
 * 打印欢迎消息
 */
logger.info(`=======================================
 ██╗ ██████╗ █████╗ ██████╗ ██╗   ██╗███████╗
 ██║██╔════╝██╔══██╗██╔══██╗██║   ██║██╔════╝
 ██║██║     ███████║██████╔╝██║   ██║███████╗
 ██║██║     ██╔══██║██╔══██╗██║   ██║╚════██║
 ██║╚██████╗██║  ██║██║  ██║╚██████╔╝███████║
 ╚═╝ ╚═════╝╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝ ╚══════╝
=============================================`);

/**
 * 检查是否安装了所有依赖项
 */
require('../include/dependency')(hexo);

/**
 * 配置文件检查和迁移
 */
require('../include/config')(hexo);

/**
 * 注册十六进制扩展并删除可能导致OOM的十六进制过滤器  
 */
require('../include/register')(hexo);